app/Controllers/Kegiatan_Csr.php

SELECT `volume`, `kegiatan_csr`.`id`, `kegiatan_csr`.`tahun`, `ruang_lingkup`.`ket` as `ruang_lingkup`, `urusan_bidang`.`ket` as `urusan_bidang`, `kegiatan_csr`.`program_kegiatan`, `aktifitas`, `kegiatan_csr`.`alamat`, `kalurahan`.`nm_kapanewon` as `kapanewon`, `kalurahan`.`nm_kalurahan` as `kalurahan`, `kegiatan_csr`.`biaya`, `kegiatan_csr`.`volume`, `kegiatan_csr`.`satuan`, `kegiatan_csr`.`opd`
FROM `kegiatan_csr`
JOIN `ruang_lingkup` ON `kegiatan_csr`.`ruang_lingkup`=`ruang_lingkup`.`id`
JOIN `urusan_bidang` ON `kegiatan_csr`.`urusan_bidang`=`urusan_bidang`.`id`
JOIN `kalurahan` ON `kegiatan_csr`.`kalurahan`=`kalurahan`.`id_kalurahan`
SELECT *
FROM `urusan_bidang`
SELECT *
FROM `ruang_lingkup`
SELECT `kalurahan`.`id_kapanewon`, `kalurahan`.`nm_kapanewon`
FROM `kalurahan`
GROUP BY `kalurahan`.`id_kapanewon`, `kalurahan`.`nm_kapanewon`
---
    public function index()
    {
        if (!session()->has('username')) {
            // Redirect ke halaman login jika sesi tidak ada
            return redirect()->to('/login');
        }

        $kegiatan = $this->db->table('kegiatan_csr')
            ->select('volume, kegiatan_csr.id, kegiatan_csr.tahun, ruang_lingkup.ket as ruang_lingkup, urusan_bidang.ket as urusan_bidang, kegiatan_csr.program_kegiatan, aktifitas, kegiatan_csr.alamat, kalurahan.nm_kapanewon as kapanewon, kalurahan.nm_kalurahan as kalurahan, kegiatan_csr.biaya, kegiatan_csr.volume, kegiatan_csr.satuan, kegiatan_csr.opd')
            ->join('ruang_lingkup', 'kegiatan_csr.ruang_lingkup=ruang_lingkup.id')
            ->join('urusan_bidang', 'kegiatan_csr.urusan_bidang=urusan_bidang.id')
            ->join('kalurahan', 'kegiatan_csr.kalurahan=kalurahan.id_kalurahan')
            ->get()->getResultArray();
        $ruang_lingkup = $this->db->table('ruang_lingkup')->get()->getResultArray();
        $urusan_bidang = $this->db->table('urusan_bidang')->get()->getResultArray();
        $kapanewon = $this->db->table('kalurahan')
            ->select('kalurahan.id_kapanewon, kalurahan.nm_kapanewon')
            ->groupBy('kalurahan.id_kapanewon')
            ->groupBy('kalurahan.nm_kapanewon')
            ->get()
            ->getResultArray();

SELECT *
FROM `kalurahan`
WHERE `id_kapanewon` = '34.01.01'
---
    public function getKalurahan($id_kapanewon)
    {
        $data = $this->db->table('kalurahan')->where('id_kapanewon', $id_kapanewon)->get()->getResultArray();

SELECT `detail_kegiatan_csr`.`id`, `kegiatan_csr`.`tahun`, `ruang_lingkup`.`ket` as `ruang_lingkup`, `urusan_bidang`.`ket` as `urusan_bidang`, `kegiatan_csr`.`program_kegiatan`, `aktifitas`, `kegiatan_csr`.`alamat`, `kalurahan`.`nm_kapanewon` as `kapanewon`, `kalurahan`.`nm_kalurahan` as `kalurahan`, `kegiatan_csr`.`biaya`, `kegiatan_csr`.`volume`, `kegiatan_csr`.`satuan`, `kegiatan_csr`.`opd`, `detail_kegiatan_csr`.`nominal`, `detail_kegiatan_csr`.`file`
FROM `detail_kegiatan_csr`
JOIN `kegiatan_csr` ON `detail_kegiatan_csr`.`id_kegiatan_csr`=`kegiatan_csr`.`id`
JOIN `ruang_lingkup` ON `kegiatan_csr`.`ruang_lingkup`=`ruang_lingkup`.`id`
JOIN `urusan_bidang` ON `kegiatan_csr`.`urusan_bidang`=`urusan_bidang`.`id`
JOIN `kalurahan` ON `kegiatan_csr`.`kalurahan`=`kalurahan`.`id_kalurahan`
WHERE `id_user` = '2'
---
    public function my_kegiatan_csr()
    {
        $kegiatan = $this->db->table('detail_kegiatan_csr')
            ->select('detail_kegiatan_csr.id, kegiatan_csr.tahun, ruang_lingkup.ket as ruang_lingkup, urusan_bidang.ket as urusan_bidang, kegiatan_csr.program_kegiatan, aktifitas, kegiatan_csr.alamat, kalurahan.nm_kapanewon as kapanewon, kalurahan.nm_kalurahan as kalurahan, kegiatan_csr.biaya, kegiatan_csr.volume, kegiatan_csr.satuan, kegiatan_csr.opd, detail_kegiatan_csr.nominal, detail_kegiatan_csr.file')
            ->where('id_user', session('id_user'))
            ->join('kegiatan_csr', 'detail_kegiatan_csr.id_kegiatan_csr=kegiatan_csr.id')
            ->join('ruang_lingkup', 'kegiatan_csr.ruang_lingkup=ruang_lingkup.id')
            ->join('urusan_bidang', 'kegiatan_csr.urusan_bidang=urusan_bidang.id')
            ->join('kalurahan', 'kegiatan_csr.kalurahan=kalurahan.id_kalurahan')
            ->get()->getResultArray();

SELECT *
FROM `kegiatan_upload`
---
    public function kegiatan_upload_all()
    {
        $kegiatan = $this->db->table('kegiatan_upload')->get()->getResultArray();

SELECT *
FROM `ruang_lingkup`
WHERE `id` = '6'
SELECT *
FROM `urusan_bidang`
WHERE `id` = '18'
SELECT *
FROM `kalurahan`
WHERE `id_kalurahan` = '34.01.01.2011'
UPDATE `kegiatan_upload` SET `tahun` = '2021', `id_ruang` = '6', `ruang_lingkup` = 'PROGRAM YANG SECARA LANGSUNG DITUJUKAN KEPADA MASYARAKAT', `id_urusan` = '18', `urusan_bidang` = 'Pertanian', `program_kegiatan` = 'Penyediaan pembiayaan untuk kegiatan pengembangan sosial, ekonomi, dan budaya masyarakat serta pembangunan/rehabilitasi fasilitas umum.', `aktifitas` = 'tes5', `alamat` = 'tes6', `id_kapanewon` = '34.01.01', `kapanewon` = 'TEMON', `id_kalurahan` = '34.01.01.2011', `kalurahan` = 'TEMON WETAN', `biaya` = '100', `volume` = '2', `satuan` = 'tes', `opd` = 'tes'
WHERE `id` = '1'
---
    public function kegiatan_upload_update()
    {
        // dd($this->request->getVar());

        $ruang = $this->db->table('ruang_lingkup')->where('id', $this->request->getVar('ruang_lingkup'))->get()->getRowArray();
        $urusan = $this->db->table('urusan_bidang')->where('id', $this->request->getVar('urusan_bidang'))->get()->getRowArray();
        $kalurahan = $this->db->table('kalurahan')->where('id_kalurahan', $this->request->getVar('kalurahan'))->get()->getRowArray();

        $this->db->table('kegiatan_upload')
            ->set('tahun', $this->request->getVar('tahun'))
            ->set('id_ruang', $this->request->getVar('ruang_lingkup'))
            ->set('ruang_lingkup', $ruang['ket'])
            ->set('id_urusan', $this->request->getVar('urusan_bidang'))
            ->set('urusan_bidang', $urusan['ket'])
            ->set('program_kegiatan', $this->request->getVar('program_kegiatan'))
            ->set('aktifitas', $this->request->getVar('aktifitas'))
            ->set('alamat', $this->request->getVar('alamat'))
            ->set('id_kapanewon', $this->request->getVar('kapanewon'))
            ->set('kapanewon', $kalurahan['nm_kapanewon'])
            ->set('id_kalurahan', $this->request->getVar('kalurahan'))
            ->set('kalurahan', $kalurahan['nm_kalurahan'])
            ->set('biaya', $this->request->getVar('biaya'))
            ->set('volume', $this->request->getVar('volume'))
            ->set('satuan', $this->request->getVar('satuan'))
            ->set('opd', $this->request->getVar('opd'))
            ->where('id', $this->request->getVar('id'))
            ->update();