app/Controllers/Laporan.php

SELECT `file`, `kegiatan_csr`.`id`, `kegiatan_csr`.`tahun`, `ruang_lingkup`.`ket` as `ruang_lingkup`, `urusan_bidang`.`ket` as `urusan_bidang`, `urusan_bidang`.`id` as `id_urusan`, `kegiatan_csr`.`program_kegiatan`, `aktifitas`, `kegiatan_csr`.`alamat`, `kalurahan`.`nm_kapanewon` as `kapanewon`, `kalurahan`.`id_kapanewon` as `id_kapanewon`, `kalurahan`.`nm_kalurahan` as `kalurahan`, `kalurahan`.`id_kalurahan` as `id_kalurahan`, `kegiatan_csr`.`biaya`, `kegiatan_csr`.`volume`, `kegiatan_csr`.`satuan`, `kegiatan_csr`.`opd`, `nama_perusahaan`, `waktu`, `nominal`
FROM `kegiatan_csr`
JOIN `detail_kegiatan_csr` ON `kegiatan_csr`.`id`=`detail_kegiatan_csr`.`id_kegiatan_csr`
JOIN `user` ON `detail_kegiatan_csr`.`id_user`=`user`.`id`
JOIN `perusahaan` ON `user`.`id`=`perusahaan`.`id_user`
JOIN `ruang_lingkup` ON `kegiatan_csr`.`ruang_lingkup`=`ruang_lingkup`.`id`
JOIN `urusan_bidang` ON `kegiatan_csr`.`urusan_bidang`=`urusan_bidang`.`id`
JOIN `kalurahan` ON `kegiatan_csr`.`kalurahan`=`kalurahan`.`id_kalurahan`
WHERE `file` is NOT NULL
SELECT *
FROM `urusan_bidang`
SELECT *
FROM `ruang_lingkup`
SELECT `program_kegiatan`
FROM `kegiatan_csr`
GROUP BY `program_kegiatan`
ORDER BY `program_kegiatan` ASC
SELECT `kalurahan`.`id_kapanewon`, `kalurahan`.`nm_kapanewon`
FROM `kalurahan`
GROUP BY `kalurahan`.`id_kapanewon`, `kalurahan`.`nm_kapanewon`
SELECT `perusahaan`.`id`, `nama_perusahaan`
FROM `perusahaan`
JOIN `user` ON `perusahaan`.`id_user`=`user`.`id`
WHERE `level` > 0
SELECT `aktifitas`
FROM `kegiatan_csr`
GROUP BY `aktifitas`
ORDER BY `aktifitas` ASC
---
    public function index()
    {
        $report = $this->db->table('kegiatan_csr')
            ->select('file,kegiatan_csr.id, kegiatan_csr.tahun, ruang_lingkup.ket as ruang_lingkup, urusan_bidang.ket as urusan_bidang, urusan_bidang.id as id_urusan, kegiatan_csr.program_kegiatan, aktifitas, kegiatan_csr.alamat, kalurahan.nm_kapanewon as kapanewon, kalurahan.id_kapanewon as id_kapanewon, kalurahan.nm_kalurahan as kalurahan,  kalurahan.id_kalurahan as id_kalurahan, kegiatan_csr.biaya, kegiatan_csr.volume, kegiatan_csr.satuan, kegiatan_csr.opd, nama_perusahaan, waktu, nominal, detail_kegiatan_csr.vol_salur')
            ->join('detail_kegiatan_csr', 'kegiatan_csr.id=detail_kegiatan_csr.id_kegiatan_csr')
            ->join('user', 'detail_kegiatan_csr.id_user=user.id')
            ->join('perusahaan', 'user.id=perusahaan.id_user')
            ->join('ruang_lingkup', 'kegiatan_csr.ruang_lingkup=ruang_lingkup.id')
            ->join('urusan_bidang', 'kegiatan_csr.urusan_bidang=urusan_bidang.id')
            ->join('kalurahan', 'kegiatan_csr.kalurahan=kalurahan.id_kalurahan')
            ->where('file is NOT NULL ')
            ->get()->getResultArray();
        // $urusan_bidang = $this->db->table('urusan_bidang')->get()->getResultArray();
        $ruang_lingkup = $this->db->table('ruang_lingkup')->get()->getResultArray();
        $kapanewon = $this->db->table('kalurahan')
            ->select('kalurahan.id_kapanewon, kalurahan.nm_kapanewon')
            ->groupBy('kalurahan.id_kapanewon')
            ->groupBy('kalurahan.nm_kapanewon')
            ->get()
            ->getResultArray();
        $perusahaan = $this->db->table('perusahaan')
            ->select('perusahaan.id, nama_perusahaan')
            ->join('user', 'perusahaan.id_user=user.id')
            ->where('level >', 0)
            ->get()->getResultArray();
        // $kegiatan_filter = $this->db->table('kegiatan_csr')
        //     ->select('program_kegiatan')
        //     ->groupby('program_kegiatan')
        //     ->orderby('program_kegiatan','ASC')
        //     ->get()->getResultArray();
        $aktifitas_filter = $this->db->table('kegiatan_csr')
        ->select('aktifitas')
        ->groupby('aktifitas')
        ->orderby('aktifitas','ASC')
        ->get()->getResultArray();