app/Controllers/Perusahaan.php

    public function perusahaan_hapus($id)
    {
        $cekUser = $this->db->table('perusahaan')->where('id', $id)->get()->getRowArray();
        // dd($cekUser['id_user']);
        $this->db->table('perusahaan')->where('id', $id)->delete();
        $this->db->table('user')->where('id', $cekUser['id_user'])->delete();
---
SELECT *
FROM `perusahaan`
WHERE `id` = '86'
DELETE FROM `perusahaan`
WHERE `id` = '86'
DELETE FROM `user`
WHERE `id` = '86'