app/Controllers/Perusahaan.php

    public function index(): string
    {
        $perusahaan = $this->db->table('perusahaan')
            ->join('user', 'perusahaan.id_user=user.id')
            ->where('level >', 0)
            ->get()->getResultArray();
---
SELECT *
FROM `perusahaan`
JOIN `user` ON `perusahaan`.`id_user`=`user`.`id`
WHERE `level` > 0