app/Controllers/Perusahaan.php

    public function index(): string
    {
        $perusahaan = $this->db->table('perusahaan')
            ->select('perusahaan.*,user.username, user.password, user.password2')
            ->join('user', 'user.id=perusahaan.id_user')
            ->where('level >', 0)
            ->get()->getResultArray();
---
SELECT `perusahaan`.*, `user`.`username`, `user`.`password`, `user`.`password2`
FROM `perusahaan`
JOIN `user` ON `user`.`id`=`perusahaan`.`id_user`
WHERE `level` > 0

    public function edit($id)
    {
        $perusahaan = $this->db->table('perusahaan')
            ->select('perusahaan.*,user.username, user.password, user.password2')
            ->join('user', 'perusahaan.id_user=user.id')
            ->where('perusahaan.id', $id)->get()->getRowArray();
---
SELECT `perusahaan`.*, `user`.`username`, `user`.`password`, `user`.`password2`
FROM `perusahaan`
JOIN `user` ON `perusahaan`.`id_user`=`user`.`id`
WHERE `perusahaan`.`id` = '88'

    public function perusahaan_hapus($id)
    {
        $cekUser = $this->db->table('perusahaan')->where('id', $id)->get()->getRowArray();
        // dd($cekUser['id_user']);
        $this->db->table('perusahaan')->where('id', $id)->delete();
        $this->db->table('user')->where('id', $cekUser['id_user'])->delete();
---
SELECT *
FROM `perusahaan`
WHERE `id` = '88'
DELETE FROM `perusahaan`
WHERE `id` = '88'
DELETE FROM `user`
WHERE `id` = '88'