app/Controllers/Publikasi.php

SELECT `publikasi`.*
FROM `publikasi`
JOIN `user` ON `publikasi`.`id_user`=`user`.`id`
WHERE `id_user` = '2'
---
    public function index()
    {
        if (!session()->has('username')) {
            // Redirect ke halaman login jika sesi tidak ada
            return redirect()->to('/login');
        }

        $query = $this->db->table('publikasi')
            ->select('publikasi.*')
            ->join('user', 'publikasi.id_user=user.id');
        if (session('id_user') > 0) {
            $query->where('id_user', session('id_user'));
        }
        // ->where('level >', 0)
        $publikasi = $query->get()
            ->getResultArray();

SELECT *
FROM `publikasi`
WHERE `id` = '10'
---
    public function publikasi_edit($id)
    {
        if (!session()->has('username')) {
            // Redirect ke halaman login jika sesi tidak ada
            return redirect()->to('/login');
        }

        $publikasi = $this->db->table('publikasi')
            ->where('id', $id)->get()->getRowArray();

SELECT *
FROM `publikasi`
WHERE `id` = '10'
UPDATE `publikasi` SET `judul` = 'szd22', `slug` = 'rvrppHSOOFmEllVul6An', `deskripsi` = '&lt;p&gt;tres des2&lt;/p&gt;', `author` = 'pdam.kp2'
WHERE `id` = '10'
---
    public function publikasi_update()
    {
        $publikasi = $this->db->table('publikasi')
            ->where('id', $this->request->getVar('id'))->get()->getRowArray();
        // dd($this->request->getFile('foto')->getName());

        if ($this->request->getFile('foto')->getName() == '') {

            $encrypted = random_string('alnum', 20);
            $this->db->table('publikasi')
                ->set('judul', $this->request->getVar('judul'))
                ->set('slug', $encrypted)
                ->set('deskripsi', $this->request->getVar('deskripsi'))
                ->set('author', $this->request->getVar('author'))
                ->where('id', $this->request->getVar('id'))
                ->update();

UPDATE `publikasi` SET `judul` = NULL, `slug` = 'I4q85rKCWVPg3uIWbvVN', `foto` = '1741661984_146ff3ce9aac10753714.jpg', `deskripsi` = NULL, `author` = NULL
WHERE `id` IS NULL
---
                $image->move('publikasi', $newName);

                $encrypted = random_string('alnum', 20);
                $this->db->table('publikasi')
                    ->set('judul', $this->request->getVar('judul'))
                    ->set('slug', $encrypted)
                    ->set('foto', $newName)
                    ->set('deskripsi', $this->request->getVar('deskripsi'))
                    ->set('author', $this->request->getVar('author'))
                    ->where('id', $this->request->getVar('id'))
                    ->update();

SELECT *
FROM `publikasi`
WHERE `slug` = '5XF0xWxl0M0VaQZTedL6'
UPDATE `publikasi` SET `status` = 1
WHERE `slug` = '5XF0xWxl0M0VaQZTedL6'
---
    public function publikasi_view($id)
    {
        $cek = $this->db->table('publikasi')->where('slug', $id)->get()->getRowArray();
        // dd($cek);
        if ($cek['status'] == 1) {
            $ganti_status = 0;
        } else {
            $ganti_status = 1;
        }
        $this->db->table('publikasi')
            ->set('status', $ganti_status)
            ->where('slug', $id)
            ->update();