app/Controllers/User.php

SELECT `perusahaan`.*, `user`.`username`, `user`.`password`, `user`.`level`
FROM `perusahaan`
JOIN `user` ON `perusahaan`.`id_user`=`user`.`id`
WHERE `username` = 'admin'
---
    public function verifikasi()
    {

        $recaptchaResponse = $this->request->getPost('g-recaptcha-response');

        // Ambil Secret Key dari file .env
        $secretKey = getenv('RECAPTCHA_SECRET_KEY');

        // Kirim permintaan untuk verifikasi ke Google
        $verifyResponse = file_get_contents("https://www.google.com/recaptcha/api/siteverify?secret={$secretKey}&response={$recaptchaResponse}");
        $responseData = json_decode($verifyResponse);

        // Memeriksa hasil verifikasi reCAPTCHA
        if (!$responseData->success) {
            // Jika verifikasi gagal
            return redirect()->back()->with('error', 'Recaptcha verification failed. Please try again.');
        }

        $user = $this->db->table('perusahaan')
            ->select('perusahaan.*,user.username, user.password, user.level')
            ->join('user', 'perusahaan.id_user=user.id')
            ->where('username', $this->request->getVar('username'))->get()->getRowArray();